# include <iostream>
using namespace std;

int main(){
    // 3.1 算数运算符
    // 1. 加减乘除
    int a1 = 10,b1 = 3;
    cout<< "a1+b1=\t" << a1+b1 <<"\n";
    cout<< "a1-b1=\t" << a1-b1 <<"\n";
    cout<< "a1*b1=\t" << a1*b1 <<"\n";
    cout<< "a1/b1=\t" << a1/b1 <<"\n";  // 两个整数相除,结果依然为整数,将小数部分去除
    cout<< "a1%b1=\t" << a1%b1 <<"\n";  // 取模运算本质: 求余数
    // 2. 递增递减
    int a = 10;
    ++a;
    cout<< "前置递增:\t" << a1 <<"\n";  // 前置递增: 先加1,再赋值给a
    cout<< "后置递增:\t" << a <<"\n";  // 后置递增: 先赋值给a,再加1
    --a;
    cout<< "前置递减:\t" << a <<"\n";  // 前置递减: 先减1,再赋值给a
    a--;
    cout<< "后置递减:\t" << a <<"\n";  // 后置递减: 先赋值给a,再减1
    // 前置后置的区别
    int a3 = 10;
    int b3 = ++a3*10;
    cout << "a2 = \t"<< a3 <<"\n";
    cout << "b2 = \t"<< b3 <<"\n";
    int a4 = 10;
    int b4 = a4++*10;
    cout << "a4 = \t"<< a4 <<"\n";
    cout << "b4 = \t"<< b4 <<"\n";
    int a5 = 10;
    int b5 = --a5*10;
    cout << "a5 = \t"<< a5 <<"\n";
    cout << "b5 = \t"<< b5 <<"\n";
    int a6 = 10;
    int b6 = a6--*10;
    cout << "a6 = \t"<< a6 <<"\n";
    cout << "b6 = \t"<< b6 <<"\n";

    // 3.2 赋值运算符
    // 1. =
    a = 100;
    cout << "a = \t" << a << "\n";
    // 2. +=
    a += 10;
    cout << "a += 10 = \t" << a << "\n";
    // 3. -=
    a -= 10;
    cout << "a -= 10 = \t" << a << "\n";
    // 4. *=
    a *= 10;
    cout << "a *= 10 = \t" << a << "\n";
    // 5. %=
    a %= 10;
    cout << "a %= 10 = \t" << a << "\n";

    // 3.3 比较运算符
    // 1. ==
    cout << "10 == 10 = \t" << (10 == 10) << "\n";
    // 2. !=
    cout << "10 != 10 = \t" << (10 != 10) << "\n";
    // 3. >
    cout << "10 > 10 = \t" << (10 > 10) << "\n";
    // 4. <
    cout << "10 < 10 = \t" << (10 < 10) << "\n";
    // 5. >=
    cout << "10 >= 10 = \t" << (10 >= 10) << "\n";
    // 6. <=
    cout << "10 <= 10 = \t" << (10 <= 10) << "\n";

    // 3.4 逻辑运算符
    // 1. 非
    cout << "非:\t" << !true << "\n";
    // 2. 与
    cout << "与:\t" << (true && false) << "\n";
    // 3. 或
    cout << "或:\t" << (true || false) << "\n";
    return 0;
}